Revit 2024 API
RebarConstraint.IsFixedDistanceToHostFace Method
 Returns true if the RebarConstraintType of the RebarConstraint is 'FixedDistanceToHostFace.'
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsFixedDistanceToHostFace()
Visual Basic
Public Function IsFixedDistanceToHostFace As Boolean
Visual C++
public:
bool IsFixedDistanceToHostFace()
See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace